app/Controllers/Articles.php

    public function index()
    {
        // $db = db_connect();  // to test db connection
        // $db->listTables();

        // $article = new ArticleMOdel();  // as we have made common Article Model in constructor
        // $data = $this->model->findAll();
        // $data = $this->model->select('article.*,users.first_name')->join('users', 'users.id=article.users_id')->findAll();
        $data = $this->model->select('article.*,users.first_name')->join('users', 'users.id=article.users_id')->orderBy('created_at')->paginate(3);
---
SELECT COUNT(*) AS `numrows`
FROM `article`
JOIN `users` ON `users`.`id`=`article`.`users_id`
SELECT `article`.*, `users`.`first_name`
FROM `article`
JOIN `users` ON `users`.`id`=`article`.`users_id`
ORDER BY `created_at`
 LIMIT 3